renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/r_aws_cellular_if.h
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2022 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : r_aws_cellular_if.h
 * Description  : Configures the driver.
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include "cellular_platform.h"
#include "cellular_common.h"
#include "cellular_common_internal.h"
#include "cellular_api.h"
#include "cellular_common_api.h"
#include "cellular_common_portable.h"

#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#include "r_sci_rl_if.h"
#else
#include "r_sci_rx_if.h"
#include "r_irq_rx_if.h"
#include "r_irq_rx_config.h"
#endif

#include "r_aws_cellular_config.h"
#include "cellular_ryz.h"


#ifndef AWS_CELLULAR_IF_H
#define AWS_CELLULAR_IF_H

/**********************************************************************************************************************
 * Macro definitions
 *********************************************************************************************************************/
#define AWS_CELLULAR_RESTART_LIMIT          (20U)

#define AWS_CELLULAR_MAX_UE_SVN_LENGTH      (15U)
#define AWS_CELLULAR_MAX_LR_SVN_LENGTH      (20U)

#define AWS_CELLULAR_RTS_DELAYTIME          (600U)       /* Delay time after RTS (millisecond) */

#define AWS_CELLULAR_SEMAPHORE_BLOCK_TIME   (10000U)

#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
/* Reset port pin macros.  */
#define AWS_CELLULAR_SET_PDR(x, y)            (AWS_CELLULAR_SET_PDR_PREPROC(x, y))
#define AWS_CELLULAR_SET_PDR_PREPROC(x, y)    ((PM ## x ## _bit.no ## y))
#define AWS_CELLULAR_SET_PODR(x, y)           (AWS_CELLULAR_SET_PODR_PREPROC(x, y))
#define AWS_CELLULAR_SET_PODR_PREPROC(x, y)   ((P ## x ## _bit.no ## y))
#else
/* PDR port macros. */
#define AWS_CELLULAR_SET_PDR(x, y)          (AWS_CELLULAR_SET_PDR_PREPROC(x, y))
/* Set the port direction. */
#define AWS_CELLULAR_SET_PDR_PREPROC(x, y)  ((PORT ## x .PDR.BIT.B ## y))

/* PODR port macros. */
#define AWS_CELLULAR_SET_PODR(x, y)         (AWS_CELLULAR_SET_PODR_PREPROC(x, y))
/* Set the port I/O. */
#define AWS_CELLULAR_SET_PODR_PREPROC(x, y)   ((PORT ## x .PODR.BIT.B ## y))
#endif

#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
/* PIDR port macros. */
#define AWS_CELLULAR_GET_PIDR(x, y)         (AWS_CELLULAR_GET_PIDR_PREPROC(x, y))
/* Get the port I/O. */
#define AWS_CELLULAR_GET_PIDR_PREPROC(x, y) ((PORT ## x .PIDR.BIT.B ## y))
/* PMR port macros. */
#define AWS_CELLULAR_SET_PMR(x, y)          (AWS_CELLULAR_SET_PMR_PREPROC(x, y))
/* SET the port I/O. */
#define AWS_CELLULAR_SET_PMR_PREPROC(x, y)  ((PORT ## x .PMR.BIT.B ## y))
/* PFS port macros. */
#define AWS_CELLULAR_SET_PFS(x, y)          (AWS_CELLULAR_SET_PFS_PREPROC(x, y))
/* SET the PFS value. */
#define AWS_CELLULAR_SET_PFS_PREPROC(x, y)  ((MPC.P ## x ## y ##PFS.BYTE))
#endif

/* Convert a macro value to a string */
#define AWS_CELLULAR_STRING_MACRO(str)          #str
/* Call CELLULAR_STRING_MACRO */
#define AWS_CELLULAR_STRING_CONVERT(arg)        (AWS_CELLULAR_STRING_MACRO(arg))

/**********************************************************************************************************************
 * Typedef definitions
 *********************************************************************************************************************/
typedef enum
{
    AWS_CELLULAR_FIRM_UPGRADE_NONBLOCKING = 1,  // Perform firmware upgrade in non-blocking mode
    AWS_CELLULAR_FIRM_UPGRADE_CANCEL      = 2,  // Cancel firmware upgrade
} e_aws_cellular_firmupgrade_t;

typedef enum
{
    AWS_CELLULAR_NVM_TYPE_CERTIFICATE = 0,  // Certificate
    AWS_CELLULAR_NVM_TYPE_PRIVATEKEY        // PrivateKey
} e_aws_cellular_nvm_type_t;

typedef enum
{
    AWS_CELLULAR_NO_CERT_VALIDATE         = 0,  // Certificate not validated
    AWS_CELLULAR_VALIDATE_CERT_EXPDATE    = 1,  // Validate certificate chain, validity period
    AWS_CELLULAR_VALIDATE_CERT_EXPDATE_CN = 5,  // Validate certificate chain, validity period, common name
} e_aws_cellular_validate_level_t;

typedef enum
{
    AWS_CELLULAR_DISABLE_AUTO_CONNECT = 0,  // Disable automatic connection to AP
    AWS_CELLULAR_ENABLE_AUTO_CONNECT,       // Enable automatic connection to AP (next start-up or restart)
} e_aws_cellular_auto_connect_t;

