renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/r_aws_cellular_if.h
typedef enum
{
    AWS_CELLULAR_MODULE_OPERATING_LEVEL0 = 0,    // Default
    AWS_CELLULAR_MODULE_OPERATING_LEVEL1,        // Full functional use possible
    AWS_CELLULAR_MODULE_OPERATING_LEVEL2,        // Transmission function disabled
    AWS_CELLULAR_MODULE_OPERATING_LEVEL3,        // Reception function disabled
    AWS_CELLULAR_MODULE_OPERATING_LEVEL4,        // In-flight mode
    AWS_CELLULAR_MODULE_OPERATING_LEVEL5,        // Reserved
} e_aws_cellular_module_status_t;

typedef enum
{
    AWS_CELLULAR_MODULE_FLG_INIT = 0,   // Initial value
    AWS_CELLULAR_MODULE_START_FLG,      // Received +SYSSTART URC
    AWS_CELLULAR_MODULE_SHUTDOWN_FLG,   // Received +SHUTDONW URC
} e_aws_cellular_module_flg_t;

typedef struct aws_cellular_svn
{
    uint8_t ue_svn[AWS_CELLULAR_MAX_UE_SVN_LENGTH+1];   // UE Software Version Number
    uint8_t lr_svn[AWS_CELLULAR_MAX_LR_SVN_LENGTH+1];   // LR Software Version Number
} st_aws_cellular_svn_t;

typedef struct aws_cellular_timeout
{
    volatile uint8_t    over_flg;
    volatile uint8_t    timeout_flg;
    uint32_t            start_time;
    uint32_t            end_time;
} st_aws_cellular_timeout_ctrl_t;

typedef struct aws_cellular_ctrl
{
    e_aws_cellular_module_flg_t module_flg;         // Module state
    uint8_t                     psm_mode;           // PSM setting state
    void *                      rts_semaphore;      // Semaphore handle
    void *                      ring_event;         // Event Group Handles
    void *                      ring_taskhandle;    // Task handle
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
    irq_handle_t                ring_irqhandle;     // IRQ control block handle
#endif
} st_aws_cellular_ctrl_t;

extern CellularCommInterface_t g_cellular_comm_interface;
extern st_aws_cellular_ctrl_t  g_aws_cellular_ctrl;

/*****************************************************************************
 * Public Functions
 *****************************************************************************/
/*************************************************************************************************
 * Function Name  @fn            R_AWS_CELLULAR_Open
 * Description    @details       Establish a communication state with the module.
 * Arguments      @param[in/out] cellularHandle -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully established a communication state with the module
 *                               Others -
 *                                  Error code indicating the cause of the error.
 ************************************************************************************************/
CellularError_t R_AWS_CELLULAR_Open (CellularHandle_t * cellularHandle);

/*************************************************************************************************
 * Function Name  @fn            R_AWS_CELLULAR_Close
 * Description    @details       Terminate communication with the module.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully disconnected communication with module.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 ************************************************************************************************/
CellularError_t R_AWS_CELLULAR_Close (CellularHandle_t cellularHandle);

/*************************************************************************************************
 * Function Name  @fn            Cellular_GetPhoneNum
 * Description    @details       Get Phone Number.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[out]    p_phonenum -
 *                                  Pointer to store the retrieved Phone number.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained phone number.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 ************************************************************************************************/
CellularError_t Cellular_GetPhoneNum (CellularHandle_t cellularHandle,
                                      const uint8_t  * p_phonenum);

/*************************************************************************************************
 * Function Name  @fn            Cellular_SetOperator
 * Description    @details       Set up the operator.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     p_operator_name -
 *                                  Operator to be set.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully set operator.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 ************************************************************************************************/
CellularError_t Cellular_SetOperator (CellularHandle_t      cellularHandle,
                                      const uint8_t * const p_operator_name);

/*************************************************************************************************
 * Function Name  @fn            Cellular_SetBand
 * Description    @details       Set the band settings.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     p_band -
 *                                  Band to be set.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully set band.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 ************************************************************************************************/
CellularError_t Cellular_SetBand (CellularHandle_t      cellularHandle,
                                  const uint8_t * const p_band);

/*************************************************************************************************
 * Function Name  @fn            Cellular_FirmUpgrade
 * Description    @details       Perform firmware upgrade.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     p_url -
 *                                  URL of the firmware.
 *                @param[in]     command -
 *                                  Firmware upgrade command.
 *                @param[in]     spid -
 *                                  Security Profile ID.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully updated the firmware.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 ************************************************************************************************/
CellularError_t Cellular_FirmUpgrade (CellularHandle_t                   cellularHandle,
                                      const uint8_t * const              p_url,
                                      const e_aws_cellular_firmupgrade_t command,
                                      const uint8_t                      spid);

/*************************************************************************************************
 * Function Name  @fn            Cellular_GetUpgradeState
 * Description    @details       Get farm update status.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[out]    p_state -
 *                                  Pointer to structure to store state.
 *                @param[in]     size -
 *                                  Size of p_state.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained farm update status.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 ************************************************************************************************/
CellularError_t Cellular_GetUpgradeState (CellularHandle_t   cellularHandle,
                                          const uint8_t    * p_state,
                                          const uint32_t     size);

/******************************************************************************************************
 * Function Name  @fn            Cellular_WriteCertificate
 * Description    @details       Write certificate or private key to non-volatile memory of the module.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     data_type -
 *                                  Information to write.
 *                @param[in]     index -
 *                                  Destination index.
 *                @param[in]     p_data -
 *                                  Pointer to the data to write.
 *                @param[in]     size -
 *                                  Size of the data to be written.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully write certificate.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 *****************************************************************************************************/
CellularError_t Cellular_WriteCertificate (CellularHandle_t                 cellularHandle,
                                            const e_aws_cellular_nvm_type_t data_type,
                                            const uint8_t                   index,
                                            const uint8_t * const           p_data,
                                            const uint32_t                  size);

/******************************************************************************************************
 * Function Name  @fn            Cellular_EraseCertificate
 * Description    @details       Erase certificate or private key to non-volatile memory of the module.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     data_type -
 *                                  Information to be deleted.
 *                @param[in]     index -
 *                                  Destination index.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully erase certificate.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 *****************************************************************************************************/
CellularError_t Cellular_EraseCertificate (CellularHandle_t                 cellularHandle,
                                            const e_aws_cellular_nvm_type_t data_type,
                                            const uint8_t                   index);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_GetCertificate
 * Description    @details       Obtain a certificate or private key stored in the module's non-volatile memory.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     data_type -
 *                                  Information to be obtained.
 *                @param[in]     index -
 *                                  Destination index.
 *                @param[out]    p_buff -
 *                                  Pointer to data writing destination.
 *                @param[in]     buff_length -
 *                                  Size of p_buff.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained certificate
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_GetCertificate (CellularHandle_t                cellularHandle,
                                         const e_aws_cellular_nvm_type_t data_type,
                                         const uint8_t                   index,
                                         const uint8_t                 * p_buff,
                                         const uint32_t                  buff_length);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_ConfigSSLProfile
 * Description    @details       Configurate security profile.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     security_profile_id -
 *                                  Security Profile identifier
 *                @param[in]     cert_valid_level -
 *                                  Server certificate validation
 *                @param[in]     ca_certificate_id -
 *                                  Certificate ID of a trusted certification authority
 *                                    by written to non-volatile memory.
 *                @param[in]     client_certificate_id -
 *                                  Client certificate ID by written to non-volatile memory.
 *                @param[in]     client_privatekey_id -
 *                                  Privatekey ID by written to non-volatile memory.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully configurate.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_ConfigSSLProfile (CellularHandle_t                       cellularHandle,
                                            const uint8_t                         security_profile_id,
                                            const e_aws_cellular_validate_level_t cert_valid_level,
                                            const uint8_t                         ca_certificate_id,
                                            const uint8_t                         client_certificate_id,
                                            const uint8_t                         client_privatekey_id);

