renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/r_aws_cellular_if.h
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
/***************************************************************************************************************
 * Function Name  @fn            Cellular_ConfigTlslSocket
 * Description    @details       TLS socket configuration.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_id -
 *                                  Socket ID.
 *                @param[in]     enable -
 *                                  enable TLS.
 *                @param[in]     security_profile_id -
 *                                  Security profile ID.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully configurate.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_ConfigTlslSocket (CellularHandle_t cellularHandle,
                                           const uint8_t    socket_id,
                                           const bool       enable,
                                           const uint8_t    security_profile_id);
#endif

/***************************************************************************************************************
 * Function Name  @fn            Cellular_PingRequest
 * Description    @details       Perform Ping.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     p_hostname -
 *                                  Pointer to destination host name.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully Ping.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_PingRequest (CellularHandle_t      cellularHandle,
                                      const uint8_t * const p_hostname);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_StartUpLink
 * Description    @details       Starts an uplink continuous wave service.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     enable -
 *                                  1 to start; 0 to stop.
 *                @param[in]     earfcn -
 *                                  An E-UTRA Absolute Radio Frequency Channel Number.
 *                @param[in]     level -
 *                                  RF output power level of the continuous wave signal, in hundredths of dBm.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully launch of uplink continuous wave service.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_StartUpLink (CellularHandle_t cellularHandle,
                                      const uint8_t    enable,
                                      const uint16_t   earfcn,
                                      const uint32_t   level);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_StartDownLink
 * Description    @details       Starts a downlink continuous wave service.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     earfcn -
 *                                  An E-UTRA Absolute Radio Frequency Channel Number.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully launch of downlink continuous wave service.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_StartDownLink (CellularHandle_t cellularHandle,
                                        const uint16_t   earfcn);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_AutoAPConnectConfig
 * Description    @details       Enable/disable automatic connection to APs.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     type -
 *                                  Enable/disable.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully configured.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_AutoAPConnectConfig (CellularHandle_t                    cellularHandle,
                                              const e_aws_cellular_auto_connect_t type);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_UnlockSIM
 * Description    @details       Unlock the SIM.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     p_pass -
 *                                  Pointer to password.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully unlocked SIM.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_UnlockSIM (CellularHandle_t      cellularHandle,
                                    const uint8_t * const p_pass);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_FactoryReset
 * Description    @details       Restore factory conditions.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully factory reset.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_FactoryReset (CellularHandle_t cellularHandle);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_SetBaudrate
 * Description    @details       Set communication baud rate with module.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     baudrate -
 *                                  Set baud rate.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully set baud rate.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_SetBaudrate (CellularHandle_t cellularHandle,
                                      const uint32_t   baudrate);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_GetSVN
 * Description    @details       Get SVN.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[out]    p_svn -
 *                                  Pointer to store the retrieved SVN.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully obtained SVN.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_GetSVN (CellularHandle_t              cellularHandle,
                                 const st_aws_cellular_svn_t * p_svn);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_SetEidrxSettingsEXT
 * Description    @details       Set eDRX.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     p_eidrxsettings -
 *                                  Pointer to the configuration structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully set up eDRX.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_SetEidrxSettingsEXT (CellularHandle_t                cellularHandle,
                                              const CellularEidrxSettings_t * p_eidrxsettings);

/***************************************************************************************************************
 * Function Name  @fn            Cellular_GetSocketDataSize
 * Description    @details       Get socket information.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     socketHandle -
 *                                  Socket handle.
 *                @param[out]    p_size -
 *                                  Pointer to destination of acquisition information.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Socket information is successfully obtained.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t Cellular_GetSocketDataSize (CellularHandle_t        cellularHandle,
                                             CellularSocketHandle_t socketHandle,
                                             const uint16_t       * p_size);

#if AWS_CELLULAR_CFG_URC_CHARGET_ENABLED == 1
void AWS_CELLULAR_CFG_URC_CHARGET_FUNCTION (const char * pRawData,
                                            void       * pCallbackContext);
#endif

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_serial_reopen
 * Description    @details       Start serial communication again after setting the baud rate.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 *                @param[in]     baudrate -
 *                                  Set baud rate.
 * Return Value   @retval        SCI_SUCCESS -
 *                                  Successfully initiated serial communication.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
sci_err_t aws_cellular_serial_reopen (CellularHandle_t cellularHandle, const uint32_t baudrate);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_temp_close
 * Description    @details       Terminate serial communication.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 * Return Value   @retval        SCI_SUCCESS -
 *                                  Successfully terminated serial communication.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
sci_err_t aws_cellular_temp_close (CellularHandle_t cellularHandle);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_hardreset
 * Description    @details       Perform hard reset of the module.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully hard reset.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t aws_cellular_hardreset (CellularHandle_t cellularHandle);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_closesocket
 * Description    @details       Close the socket.
 * Arguments      @param[in]     cellularHandle -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully closed the socket.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t aws_cellular_closesocket (CellularHandle_t cellularHandle);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_modemevent
 * Description    @details       Module Event Management.
 * Arguments      @param[in]     modemEvent -
 *                                  Event.
 *                @param[in]     pCallbackContext -
 *                                  Context pointer to store event content.
 **************************************************************************************************************/
void aws_cellular_modemevent (CellularModemEvent_t   modemEvent,
                              void                 * pCallbackContext);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_timeout_init
 * Description    @details       Initialize timeout settings.
 * Arguments      @param[in]     timeout_ctrl -
 *                                  Timeout management structure.
 *                @param[in]     timeout -
 *                                  Set timeout period.
 **************************************************************************************************************/
void aws_cellular_timeout_init (st_aws_cellular_timeout_ctrl_t * timeout_ctrl, uint32_t timeout);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_check_timeout
 * Description    @details       Check timeout.
 * Arguments      @param[in]     timeout_ctrl -
 *                                  Timeout management structure.
 * Return Value   @retval        false -
 *                                  Not timed out.
 *                               true -
 *                                  Time out.
 **************************************************************************************************************/
bool aws_cellular_check_timeout (st_aws_cellular_timeout_ctrl_t * const timeout_ctrl);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_rts_ctrl
 * Description    @details       RTS pin control.
 * Arguments      @param[in]     lowhigh -
 *                                  Output signal.
 **************************************************************************************************************/
void aws_cellular_rts_ctrl (const uint8_t lowhigh);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_irq_callback
 * Description    @details       IRQ interrupt callback.
 * Arguments      @param[in]     p_Args -
 *                                  Callback Content.
 **************************************************************************************************************/
void aws_cellular_irq_callback (void * const p_Args);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_irq_open
 * Description    @details       Enable irq interrupt.
 * Arguments      @param[in]     p_aws_ctrl -
 *                                  Pointer to management structure for cellular module.
 * Return Value   @retval        true -
 *                                  Success.
 *                               false -
 *                                  Failure.
 **************************************************************************************************************/
bool aws_cellular_irq_open (st_aws_cellular_ctrl_t * const p_aws_ctrl);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_irq_close
 * Description    @details       Disable irq interrupt.
 * Arguments      @param[in]     p_aws_ctrl -
 *                                  Pointer to management structure for cellular module.
 **************************************************************************************************************/
void aws_cellular_irq_close (st_aws_cellular_ctrl_t * const p_aws_ctrl);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_psm_config
 * Description    @details       Perform PSM config.
 * Arguments      @param[in]     p_context -
 *                                  Pointer to managed structure.
 *                @param[in]     mode -
 *                                  Enable(1)/Disable(0) PSM.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully configured PSM config.
 *                               Others -
 *                                  Error code indicating the cause of the error.
 **************************************************************************************************************/
CellularError_t aws_cellular_psm_config (CellularContext_t * p_context, const uint8_t mode);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_psm_conf_fail
 * Description    @details       Disable PSM config settings.
 * Arguments      @param[in]     p_context -
 *                                  Pointer to managed structure.
 *                @param[in]     phase -
 *                                  PSM Config Progress.
 **************************************************************************************************************/
void aws_cellular_psm_conf_fail (CellularContext_t * p_context, const uint8_t phase);

#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_rts_active
 * Description    @details       Set the RTS pin to High output.
 * Arguments      @param[in]     p_context -
 *                                  Pointer to managed structure.
 *                @param[in]     semaphore_ret -
 *                                  Semaphore Acquisition Status.
 **************************************************************************************************************/
void aws_cellular_rts_active (CellularContext_t * p_context, BaseType_t semaphore_ret);

/***************************************************************************************************************
 * Function Name  @fn            aws_cellular_rts_deactive
 * Description    @details       Set the RTS pin to Low output.
 * Arguments      @param[in]     p_context -
 *                                  Pointer to managed structure.
 * Return Value   @retval        pdTRUE(1) -
 *                                  Succeeded in obtaining semaphore and set RTS to Low output.
 *                               pdFALSE(0) -
 *                                  Processing was not executed.
 **************************************************************************************************************/
BaseType_t aws_cellular_rts_deactive (CellularContext_t * p_context);
#endif

#endif /* AWS_CELLULAR_IF_H */
